import 'package:flutter/material.dart';
import 'package:maanikdarshan/Package/GuruParampara/DetailParampara.dart';
import 'package:maanikdarshan/Package/GuruParampara/Mahamantra.dart';

class guruParampara extends StatelessWidget {
  final images = [
    "assets/images/gan_martands/1.png",
    "assets/images/gan_martands/2.png",
    "assets/images/gan_martands/3.png",
    "assets/images/gan_martands/6.png",
    "assets/images/gan_martands/4.png",
    "assets/images/gan_martands/5.png",
    "assets/images/mahamantra.png"
  ];
  final titles = [
    "श्री सद्गुरु माणिकप्रभु महाराज",
    "श्री मनोहर माणिकप्रभु महाराज",
    "श्री मार्तंड माणिकप्रभु महाराज",
    "श्री शंकर माणिकप्रभु महाराज",
    "श्री सिद्धराज माणिकप्रभु महाराज",
    "श्री ज्ञानराज माणिकप्रभु महाराज",
    "महामंत्र"
  ];
  final descriptions = [
    "(जन्म 1817, संजीवनी महासमाधि 1865 )",
    "(जन्म 1858, पीठारोहण 1865,\n संजीवनी महासमाधि 1877)",
    "(जन्म 1861, पीठारोहण 1877,\n महासमाधि 1936)",
    "(जन्म 1895, पीठारोहण 1936,\n महासमाधि 1945 )",
    "(जन्म 1939, पीठारोहण 1945,\n महासमाधि 2009)",
    "विद्यमान पीठाधिपति \n(जन्म 1958, पीठारोहण 2009)",
    ""
  ];

  final sendImages = [
    "assets/images/sadguru_manikprabhu.png",
    "assets/images/manohar_manikprabhu.png",
    "assets/images/martand_manikprabhu.png",
    "assets/images/shankar_manikprabhu.png",
    "assets/images/siddhraj_manikprabhu.png",
    "assets/images/dnyanraj_manikprabhu.png"
  ];
  final sendTexts = [
    "श्रीप्रभूंचा जन्म मंगळवार, 22 डिसेंबर, 1817 रोजी निजामाच्या राज्यातील लाडवंती या गांवी झाला. त्यांचे पिता श्रीमनोहर नाईक व माता श्रीबयादेवी हे दोघेही अत्यंत सात्त्विक व सदाचारशील दंपती होते. त्यांच्या घरी पूर्वीपासून रामोपासना होत असे. ई.स. 1817च्या श्रीरामनवमीच्या रात्री त्या दोघांच्या स्वप्नांत श्रीदत्तप्रभु प्रकट झाले व मी तुमच्या उदरी जन्म घेणार असे सूचित केले. तदनुसार बरोबर नऊ महिन्यांनी श्रीदत्तजयंतीच्या दिवशीच श्रीप्रभूंचा जन्म झाला. बालपणांपासूनच प्रभूंच्या अंगी असलेल्या अलौकिक सामर्थ्याचा प्रत्यय लोकांना येऊ लागला. त्यांच्या बाललीलेतून अनेक अद्भुत चमत्कार सहज घडत असत. त्यांच्या लहानपणींच त्यांचे वडील मनोहरपंत निवर्तले म्हणून त्यांची माता बयादेवी प्रभु व इतर दोन भावंडांना घेऊन कल्याणच्या नबाबाच्या पदरी नौकरीस असलेल्या आपल्या भावाजवळ कल्याणांस येऊन राहिल्या. लहानपणीं प्रभु कुठल्याही शाळेंत गेले नाहींत, प्रकृति हीच त्यांची पाठशाळा होती. सवंगड्यांना घेऊन रानांत दूर निघून जाणें, दरींत, गुहेंत, प्रवाहाच्या ठिकाणी एकांतांत बसून राहणें, दोन-दोन तीन-तीन दिवस गुप्त होणें हा त्यांचा लहानपणींचा छंद होता. प्रभूंनी विद्याभ्यास करावा, नांव-लौकिक मिळवावे, कुटुंबाच्या योगक्षेमाची काळजी घ्यावी, असे त्यांच्या व्यवहारी असलेल्या मामांना वाटायचे. म्हणून त्यांनी प्रभूंना एका जकातनाक्यावर नौकरीही मिळवून दिली होती. पण तिथेही तोच प्रकार झाला. दिवसभर जमा झालेली सरकारी रकम गोरगरीबांत वाटून प्रभु मोकळे होत असत. प्रभूंच्या या स्वच्छंद वागणुकीनें त्रस्त झालेल्या मामांनी वयाच्या तेराव्या वर्षी त्यांना घरांतून हांकलून दिले. प्रभु जणूं यांच संधीची वाट पहात होते. त्यांनी नेसलेले धोतर फाडून त्याची लंगोटी केली, मामांना साष्टांग नमस्कार करून प्रभु घराबाहेर पडले. निघतांना प्रभूंनी आपले पहिले पदही रचले - 'प्रभुविण कोण कुणाचा वाली'. हेंच पद गुणगुणत प्रभु निघाले तें सरळ अमृतकुंड या तीर्थाच्या ठिकाणी प्रगट झाले. इथून सुरू झालेल्या तीर्थयात्रेचे पर्यवसान माणिकनगरच्या स्थापनेंत झाले. प्रभूंनी बारा वर्षे एकटे पायी सबंध भारतवर्ष पालथा घातला. काशी, रामेश्वर, बदरी केदार, हरिद्वार, द्वारका, पुरी, तिरुपति आदि अनेक तीर्थांना प्रभूंनी भेटी दिल्या. या तीर्थयात्रेत प्रभूंनी अनेक रंजल्यागांजल्यांचा उद्धार केला. मतमतांतरांतील वैमनस्य दूर करून सर्व धर्म व संप्रदाय आपापल्या अनुयायांस परमेश्वराची प्राप्ती करवून देण्यांत समर्थ आहेत, हे तत्त्व प्रकर्षानें पटवून दिले. या यात्रेसाठी प्रभु जेंव्हां निघाले तेंव्हा ते एकटेच होते परंतु त्यांची ही यात्रा जेंव्हां समाप्त होण्यांस आली तेंव्हां त्यांच्या सोबत हजारो माणसांचा समागम होता, त्यांत हिंदू होते तसेंच मुसलमान ही होते; ब्राह्मण होते, तसेच अठरापगड जातीचे इतर वर्णीयजनही होते; शैव होते, वैष्णव होते, शाक्त होते; एका सम्राटालाही लाजविणारे प्रभूंचे ऐश्वर्य होते. ई.स. 1845 साली प्रभु हुमनाबाद नजीकच्या अरण्यांत आले, ही जागा प्रभूंना फार आवडली व इथेच कायम वास्तव्य करण्याच्या दृष्टीने गवतांची झोपडी बांधून प्रभु इथेच राहू लागले. प्रभु राहिले म्हणून त्यांचे अनेक शिष्यही इथेच राहिले. अशा प्रकारे हुमनाबादच्या नजीक गुरुगंगा व विरजा ह्या दोन ओढ्यांच्या संगमावर माणिकनगरची स्थापना झाली. या ठिकाणीं एका गवताच्या मांडवांत श्रीदत्ताच्या गादीची स्थापना होऊन त्या समोर प्रभूंचा दरबार भरू लागला. प्रभु भक्तांची मनोकामना पुरविणारे कल्पवृक्ष होते, त्यामुळें आर्त, जिज्ञासू, अर्थार्थी व ज्ञानी असे चारही प्रकारच्या भक्तांचा मेळावा त्यांच्या भोवती सतत असायचा. त्यांच्या मुसलमान भक्तांनी त्यांना महबूब सुबहानीचा अवतार मानून पीरानेपीर दस्तगीर' म्हणून त्यांना गौरवावें तर लिंगायत भक्तांनी त्यांना साक्षात् बसवेश्वराचा अवतार समजून त्यांची पूजा करावी, प्रभु हे सर्व धर्मीयांना आपलेंच वाटत होते. त्यांच्या समकालीन विभूतींपैकी अक्कलकोटचे स्वामी, शिरडीचे साईबाबा, गोंदवल्याचे ब्रह्मचैतन्य आदि अनेक साधु सत्पुरुषांनी मुद्दाम माणिकनगरी येऊन त्यांची भेट घेतली होती. अक्कलकोटचे स्वामी तर तब्बल सहा महिने प्रभुसन्निध राहिल्याचें चरित्रांत उल्लेख आहे. त्यांची व प्रभूंची अनेक दिवस एकांतांत भेट व्हायची. स्वामींना अक्कलकोटी जाण्याबद्दल सूचना प्रभूंनीच केली होती. स्वामी प्रभूंना 'बड़े भाई' म्हणत असत. शिरडीचे साईबाबा तेरा-चौदा वर्षाचे असतांना प्रभूंना भेटण्यासाठी दरबारांत येऊन गेल्याचा उल्लेख आहे. प्रभूंची कीर्ति दूर शृंगेरी पर्यंत पोचली होती. शृंगेरी पीठाचे तत्कालीन जगद्गुरु शंकराचार्य प्रभूंच्या भेटीसाठी माणिकनगरी येऊन गेल्याचाही उल्लेख चरित्रांत सांपडतो. आपल्या भक्तांच्या आध्यात्मिक, आधिदैविक व आधिभौतिक तापांचे निरसन करून प्रभूंनी त्यांना ज्ञानयुक्त भक्तीचे धडे दिले. वेदांताच्या अद्वैत सिद्धांतावर आधारित 'सकलमत संप्रदाय' स्थापून प्रभूंनी मततांतरांचे ध्येय एक परमेश्वर असून साधना पद्धतींत भिन्नता असल्याचे दाखवून दिले. प्रभूंचे कुराणावर असाधारण अधिकार होते, ते पाहून त्यांच्या एका मुसलमान भक्तांनें त्यांना मुसलमान होण्याची गळ घातली तेंव्हा प्रभु म्हणाले \"अहो, कुराणांत परमेश्वराला रब-उल-आलमीन (विश्वाचा स्वामी) म्हटलें आहे, कुराणांत कुठेही परमेश्वराला 'रब-उल मुसलमीन' (केवल मुसलमानांचा स्वामी) म्हटलेले आढळत नाहीं, तसा दाखला तुम्हीं मला दाखवल्यांस मी मुसलमान होण्यांस तयार आहे. प्रभूंचे हें उत्तर ऐकून तो मुसलमान भक्त आश्चर्यचकित होऊन गेला. हैदराबादचा तत्कालीन निजाम अफजलुद्दौला हा निस्संतान होता. प्रभूंची कीर्ति ऐकून त्यांच्याकडून पुत्रप्राप्तीचा आशीर्वाद मिळविण्यासाठी त्यांने साठ हजार रुपयांच्या जागीरीची सनद देऊन यशवंतराव अरब नांवाच्या आपल्या सरदारांस प्रभूंकडे पाठविले होते. मूर्तिमंत वैराग्य असलेल्या प्रभूंनी साठ हजाराच्या जागीरीची ती सनद फाडून फेकून दिली व म्हणाले, \"आम्हीं फकीर, आम्हांस या जागीरीचा काय उपयोग? आम्हीं जिकडे दृष्टी वळवू तिकडे आमचीच जागीर आहे. माझ्या मालकांनी (परमेश्वरांनी) तुझ्या मालकांस (निजामास) जेवढे दिले आहे त्याहून अधिक हवे असल्यास त्याला इथे येऊन मागून घेऊन जाण्यांस सांग.\" पुढे प्रभूंच्या आशीर्वादानी निजामास मुलगा झाला, प्रभूंच्या आज्ञेनुसार त्याचे नांव महबूब ठेवण्यांत आले. पुढे हाच महबूब अली पाशा या नांवानी इतिहासांत प्रसिद्ध झाला. गरीब श्रीमंत, कुलीन अकुलीन, स्त्री-पुरुष, हिंदू - मुसलमान असा कुठला ही भेद न बाळगता प्रभूंनी सर्वांना भरपूर प्रेम दिले, सर्वांच्या कामना - पुरविल्या, सर्वांस सन्मार्गावर आणून सोडले. या प्रक्रियेत नित्य असंख्य अमानुष चमत्कार घडल्याचा प्रत्यय लोकांना सतत येत असे पण प्रभूंनी कधीही कुठल्याही चमत्काराचा श्रेय आपल्याकडे घेतला नाहीं, हंसून 'कर्ता करवीता दत्तप्रभू आहे', असे ते नेहमी म्हणत असत. प्रभूंनी मराठी, हिंदी, कानडी, उर्दू आदि अनेक भाषेतून विपुल काव्यरचना केली असून वेदांतावर लिहिलेला त्यांचा 'आत्मरूपप्रतीति' हा ग्रंथ अप्रतिम आहे. प्रभूंनी आपल्या साहित्यांत आद्य शंकराचार्यप्रणीत अद्वैत सिद्धांत अत्यंत सोप्या व सरळ भाषेत सांगितला असून 'मल्हारी माहात्म्य', 'संगमेश्वर माहात्म्य', 'हनुमंत जन्म' आदि अनेक प्रकीर्ण ग्रंथही त्यांनी रचिले आहेत. वयाच्या 47 व्या वर्षी प्रभूंनी संजीवनी महासमाधि घेतली. मंगळवार 29 नोव्हेंबर 1865 मार्गशीर्ष शुक्ल एकादशी (मोक्षदा एकादशी) ही तिथि सहा महिने आधीच समाधीसाठी निश्चित करण्यांत आली होती. फक्त अत्यंत विश्वासातल्या चार शिष्यांना अत्यंत गुप्तपणें समाधीची तयारी करण्याची आज्ञा झाली होती. ठरलेल्या दिवशी प्रात:काळी प्रभूंनी विधिवत् संन्यास आश्रम स्वीकार केला, आपल्या कनिष्ठ बंधूंच्या दोन्हीं चिरंजीवास आशीर्वाद दिला, ज्येष्ठ मनोहर (श्रीमनोहरप्रभु) यांना मंत्रदीक्षा देऊन आपला उत्तराधिकारी नेमला आणि मग समाधीत प्रवेश केला व शिष्यांस समाधी चिनून घेण्याची आज्ञा केली. श्रीप्रभूंचा सगुण देह जरी दृष्टिआड झाला तरी त्या समाधीच्या माध्यमातून त्यांची * चित्शक्ती आजही भक्तांच्या हांकेला 'ओ' देत आहे व पुढे येणाऱ्या अनंत काळापर्यंत अशाच प्रकारे \'ओ\' देत राहील यांत तिळमात्र संदेह नाही.",
    "श्री प्रभूंच्या महासमाधीनंतर त्यांचे पुतणे श्री मनोहर माणिकप्रभु महाराज वयाच्या 7व्या वर्षी पीठारूढ झाले. अवघ्या 12 वर्षांच्या कालावधीत त्यांनी श्री प्रभुमंदिराचे निर्माण कार्य करवून घेतले व सांप्रदायिक उपासाना पद्धति निर्धारित केली. प्रभु मंदिराच्या बांधकामाच्या वेळीच महाराजांनी या ठिकाणी हे तळघर बांधून घेतले व या तळघरास पाहून \"ही जागा एखाद्या योग्याला समाधी घेण्यास योग्य आहे” असे म्हणाले. वयाच्या केवळ 19व्या वर्षी ई. स. 1877 साली श्री महाराजांनी या ठिकाणी श्रीप्रभूंप्रमाणेच संजीवनी समाधीत प्रवेश केला.",
    "श्री मनोहर माणिकप्रभूंच्यानंतर त्यांचे कनिष्ट बंधू श्री मार्तंड माणिकप्रभु महाराज हें वयाच्या सोळाव्या वर्षी गादीवर आले. श्री महाराज प्रभूंचे कनिष्ठ बंधू श्री नृसिंह तात्या महाराजांचे कनिष्ठ सुपुत्र होत. श्रीमहाराजांचा जन्म माणिकनगर येथे 28 डिसेंबर 1861 रोजी झाला. श्रीप्रभु महाराज यांना लाडानी 'खंडी' म्हणत असत. \"हा साक्षात् कुलदेवता खंडेरायाचा अवतार आहे व असे छप्पन्न संस्थान उभे करण्याचे सामर्थ्य याच्यात आहे\" असें श्री प्रभु म्हणत असत. हें खऱ्या अर्थांनी राजयोगी होते. वेदांत, संगीत व मंत्रशास्त्र या विषयावर यांचे असाधारण प्रभुत्व होते. यांच्या अद्वैत वेदांतांवरील 'ज्ञानमार्तंड' या ग्रंथावर लुब्ध होऊन काशीस्थ पंडितांनी यांना 'अभिनव शंकराचार्य' ही उपाधि सादर समर्पित केली होती. यांनीच संप्रदायाचा आसेतुहिमाचल प्रसार केला व माणिकनगरांस सांप्रतचें भव्यरूप प्रदान केले. श्री महाराजांचा मराठी, उर्दू व संस्कृत भाषांवर असाधारण अधिकार होता व या भाषांमध्ये यांची काव्यरचना व ग्रंथरचना विपुल आहे. हैदराबाद संस्थानचे निजाम मीर उस्मान अली व पंतप्रधान महाराजा किशनप्रशाद बहादुर हे महाराजांचे अत्यंत निष्ठावान् भक्त होते. 12 मार्च 1936 रोजी श्रीमहाराजांनी महासमाधीत प्रवेश केला.",
    "श्री मार्तंड माणिकप्रभूंच्या महासमाधीनंतर त्यांच्या भगिनी श्रीमती मुक्ताबाई यांचे सुपुत्र श्री शंकरराव, जें श्री मार्तंड माणिकप्रभूंच्या कारकीर्दीत श्रीसंस्थानचे कार्यवाह म्हणून काम पहात होते, हे ‘श्री शंकर माणिकप्रभु' या नांवानी प्रभूंच्या गादीवर विराजमान झाले. श्री महाराजांचा जन्म माणिकनगर येथे 28 ऑक्टोबर 1895 रोजी झाला. यांच्या मातोश्रींना प्रभूंची खडतर सेवा केल्यावर पुत्रप्राप्ति झाली होती म्हणून यांना प्रभूंच्या झोळीत घालण्यांत आले होते. बालपणीच पितृवियोग व मातृवियोग झाल्यामुळे यांचें संपूर्ण संगोपन यांचे मामा श्रीमार्तंडप्रभूंनीच केले. कै. बाबासाहेब महाराजांच्या मार्गदर्शनांत यांचे शिक्षण होऊन यांनी हाइकोर्टच्या वकीलीची परीक्षा उत्तीर्ण केली होती. मराठी, उर्दू व संस्कृत भाषांवर यांचे असाधारण अधिकार होते. यांनी आपल्या नऊ वर्षांच्या कारकीर्दीत श्रीसंस्थानांत आज होत असलेल्या शैक्षणिक व सामाजिक क्रांतीचे बीजारोपण केले व संस्थानच्या व्यवस्थेमध्ये काळाच्या गरजेनुरूप अनेक सुधार केले. अद्वैत वेदांतांवर यांचे असाधारण प्रभुत्व होते, तत्कालीन 'तत्त्वज्ञान मंदिर' या मासिकांतून यांचे अनेक लेख प्रकाशित झाले असून त्या सर्वांचे संकलन 'ज्ञानशांकरी' या नांवानी प्रसिद्ध झाले आहे. श्री महाराज 28 फेब्रुवारी 1945 राजी स्वात्मानंदांत लीन झाले.",
    "श्री शंकर माणिकप्रभूंच्या महासमाधी नंतर त्यांचे सुपुत्र श्री सिद्धराज माणिकप्रभु यांना अवघ्या ६ वर्षाच्या वयांत श्रीपीठावर आरूढ झाले. श्री महाराजांचे शालेय शिक्षण ग्वालियरच्या सुप्रसिद्ध सिंधियास्कूल मधे झाले. १९५६ साली शालेय शिक्षण आटपून श्रीमहाराज माणिकनगरी परत आले आणि त्यांनी आपल्या अलौकिक कर्तबगारीने संस्थानचे सर्वांगीण विकास साधले. श्रीमार्तंड प्रभुव श्रीशंकर प्रभूंच्या संयुक्त देवालयाचे बांधकाम श्रीमहाराजांनी करवून घेतले. विविध सामाजिक व शैक्षणिक योजना राबवून श्रीमहाराजांनी माणिकनगर येथे अनेकानेक शिक्षण संस्था उभ्या केल्या. माणिक पब्लिक स्कूल, माणिक विद्यालय, वेद व संस्कअत पाठशाळा, अंध व अपंग मुलांची शाळा आदि अनेक संस्था स्थापून व त्या सर्व संस्था उत्तमरीत्या चालवून महाराजांनी माणिकनगरचे कायाकल्प करून टाकले. श्रीमहाराजांनी आसेतुहिमाचल प्रवास करून संप्रदायाचा प्रसार केला. आपल्या अलौकिक तपोबलाने त्यांनी अनेक रंजल्यागांजल्या भक्तजनांना ऐहिक उत्कर्ष व पारलौकिक नि:श्रेयस् प्राप्त करवून दिले. संगीत व वेदांत हे महाराजांच्या आवडीचे विषय असून सांप्रदायिक भजनांस लोकप्रिय करण्याचे श्रेय श्रीमहाराजांनाच जाते. ६ ऑक्टोबर २००९ रोजी श्रीमहाराज स्वस्वरूपांत लीन झाले.",
    " श्री सिद्धराज माणिकप्रभु महाराजांच्या कारकीर्दीत त्यांचे ज्येष्ठ सुपुत्र श्री ज्ञानराज हें संस्थानचे कार्यवाह म्हणून काम पाहात होते. संस्थानचे कार्यवाह म्हणून तब्बल ३४ वर्षे प्रभुसेवा केल्यावर व श्री महाराजांच्या मार्गदर्शनांत वेदांत विषयाचा सखोल अभ्यास केल्यावर २००९ साली, श्री सिद्धराज माणिकप्रभु महाराजांच्या महासमाधीनंतर श्री ज्ञानराज माणिकप्रभु महाराज हें संस्थानचे सहावे पीठाधिपति म्हणून पीठारूढ झाले. महाराजांचे हिंदी, मराठी, व उर्दू भाषेवर प्रभुत्व असून या सर्व भाषेभधून त्यांनी विपुल काव्यरचना केली आहे शालेय जीवनांत त्यांना भारताच्या राष्ट्रपतींचे पुरस्कार प्राप्त झाले होते. वेदांत हें महाराजांच्या अत्यंत आवडीचे विषय असून त्यांची प्रवचनें अत्यंत लोकप्रिय झाली आहेत. भारतातच नव्हें तर भारताबाहेर ही श्रीलंका, दुबयी, आबूधाबी आदि देशांत त्यांची वेदांत विषयक प्रवचने झाली असून त्यांतील अनेक प्रवचनें दूरदर्शनच्या माध्यमातून प्रसारितही झाली आहेत. श्रीमहाराज हे एक कुशल प्रशासक असून आधुनिक तंत्रज्ञानाचा उपयोग करून श्रीसंस्थानचे सर्वांगीण विकास साधण्यांत त्यांना यश लाभले आहे. श्रीमहाराजांच्या कुशल मार्गदर्शनाखाली माणिकनगर संस्थान हें यशाचे नित्य नवीन शिखर गाठत आहे."
  ];

  guruParampara({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    double width = MediaQuery.of(context).size.width;
    return Scaffold(
        appBar: AppBar(
          title: Text(
            'गुरुपरंपरा',
            style: TextStyle(fontFamily: 'Mukta', fontWeight: FontWeight.w800),
          ),
          backgroundColor: const Color(0xFF7F1B0E),
          centerTitle: true,
        ),
        body: Padding(
          padding: EdgeInsets.all(20),
          child: ListView.builder(
              itemCount: images.length,
              itemBuilder: (BuildContext context, int index) {
                return GestureDetector(
                    onTap: () {
                      (index == 6)
                          ? Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => Mahamantra()))
                          : Navigator.push(
                              context,
                              MaterialPageRoute(
                                  builder: (context) => DetailParampara(
                                      title: titles[index],
                                      image: sendImages[index],
                                      text: sendTexts[index])));
                    },
                    child: Column(
                      children: [
                        Row(
                          children: [
                            Image.asset(
                              images[index],
                              width: width / 4,
                            ),
                            Padding(
                                padding: EdgeInsets.only(left: 20),
                                child: Column(
                                  crossAxisAlignment: CrossAxisAlignment.start,
                                  children: [
                                    Text(
                                      titles[index],
                                      style: TextStyle(
                                        fontFamily: 'Mukta',
                                        fontSize: 18,
                                        fontWeight: FontWeight.w700,
                                        color: const Color(0xFF7F1B0E),
                                      ),
                                    ),
                                    Text(descriptions[index],
                                        style: TextStyle(
                                          fontFamily: 'Mukta',
                                          fontSize: 15,
                                          fontWeight: FontWeight.w600,
                                          color: const Color(0xFF7F1B0E),
                                        ))
                                  ],
                                ))
                          ],
                        ),
                        Padding(
                          padding: EdgeInsets.only(top: 10, bottom: 10),
                          child: Divider(color: const Color(0xFF7F1B0E)),
                        )
                      ],
                    ));
              }),
        ));
  }
}
