import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

class darshaniySthale extends StatelessWidget {
  darshaniySthale({Key? key}) : super(key: key);

  final List<String> titles = [
    'नौबतखाना',
    'श्रीप्रभु मंदिर परिसर',
    'प्राचीन औदुंबर',
    'श्रीदत्त मंदिर',
    'सटक्यांचे कक्ष',
    'सर्वेश्वराचे देवालय',
    'मुक्तिमंटप',
    'श्रीमधुमती श्यामला देवालय',
    'श्रीकालाग्निरुद्र हनुमान मंदिर',
    'श्रशिवपंचायतन मंदिर',
    'मारुतीचे मंदिर',
    'वीरशैव मठ',
    'महबूब सुबहानीचा दरगाह',
    'गुरुगंगा-विरजा संगम'
  ];
  final List<String> images = [
    'assets/images/darshaniya_sthale/1.png',
    'assets/images/darshaniya_sthale/2.png',
    'assets/images/darshaniya_sthale/3.png',
    'assets/images/darshaniya_sthale/4.png',
    'assets/images/darshaniya_sthale/5.png',
    'assets/images/darshaniya_sthale/6.png',
    'assets/images/darshaniya_sthale/7.png',
    'assets/images/darshaniya_sthale/8.png',
    'assets/images/darshaniya_sthale/9.png',
    'assets/images/darshaniya_sthale/10.png',
    'assets/images/darshaniya_sthale/11.png',
    'assets/images/darshaniya_sthale/12.png',
    'assets/images/darshaniya_sthale/13.png',
    'assets/images/darshaniya_sthale/14.png',
  ];

  final List<String> descriptions = [
    'कै. श्री बाबासाहेब महाराजांनी सन् १८९० साली या नौबतखान्याचे निर्माण करविले. सन् २०१७ साली श्री ज्ञानराज माणिकप्रभु महाराजांनी खास राजस्थानांतून कारागीर आणून या नौबतखान्याचे जीर्णोद्धार करविले. या नौबतखान्याच्या खाली भव्य अशी कमान असून वर नौबत-नगारे वाजविण्याची जागा आहे. दिवसातून चार वेळां इथे नौबत वाजत असते. ही परंपरा आद्य श्रीप्रभूंच्या काळापासून चालत आलेली आहे. याच इमारतीत श्रीसंस्थानचे कार्यालय आहे. हा नौबतखाना म्हणजे श्रीमाणिकप्रभु संस्थानचे सिंहद्वार होय. नौबतखान्याच्या बाहेरील पटांगणांत बाग-बगीचे लावून सुशोभीकरणाचे काम सध्या चालू आहे.',
    'भव्य अशा सिंहद्वारातून प्रवेश केल्यावर आपण प्रभुमंदिर परिसराच्या पटांगणांत पोचतो. हें पटांगण अत्यंत विस्तृत असून बागबगीच्यांनी व कारंजांनी सुशोभित आहे. या पटांगणांतून चढून वर गेल्यावर प्रभु मंदिराचे महाद्वार लागते. हें महाद्वार ओलांडतांच भव्य अशा आनंद मंटपांत आपण पोंचतो. या ठिकाणी भजन-कीर्तनाचे कार्यक्रम होत असतात. त्या नंतर प्रभु मंदिराचे कैलास मंटप लागते. भव्य अशा महरपीदार दगडी मंटपांत संगमरमरी फर्शी असून या मंटपांच्या छतांस हैदराबादच्या निजामांनी दिलेले भलेमाठे झुंबर टांगले गेले आहे. इथून वर प्रभूंच्या समाधी मंदिराचे गर्भगृह आहे. गर्भगृहांत श्रीप्रभूंची दिव्य संजीवनी समाधि असून समाधीच्या मागे प्रभूंनी स्वयं स्थापित केलेली श्रीदत्ताची गादी आहे.',
    'भव्य अशा सिंहद्वारातून प्रवेश केल्यावर आपण प्रभुमंदिर परिसराच्या पटांगणांत पोचतो. हें पटांगण अत्यंत विस्तृत असून बागबगीच्यांनी व कारंजांनी सुशोभित आहे. या पटांगणांतून चढून वर गेल्यावर प्रभु मंदिराचे महाद्वार लागते. हें महाद्वार ओलांडतांच भव्य अशा आनंद मंटपांत आपण पोंचतो. या ठिकाणी भजन-कीर्तनाचे कार्यक्रम होत असतात. त्या नंतर प्रभु मंदिराचे कैलास मंटप लागते. भव्य अशा महरपीदार दगडी मंटपांत संगमरमरी फर्शी असून या मंटपांच्या छतांस हैदराबादच्या निजामांनी दिलेले भलेमाठे झुंबर टांगले गेले आहे. इथून वर प्रभूंच्या समाधी मंदिराचे गर्भगृह आहे. गर्भगृहांत श्रीप्रभूंची दिव्य संजीवनी समाधि असून समाधीच्या मागे प्रभूंनी स्वयं स्थापित केलेली श्रीदत्ताची गादी आहे.',
    'श्रीप्रभु हे साक्षात् दत्तात्रेय आहेत. श्रीप्रभु केवल माधुकरी भिक्षेचे अन्न सेवीत असत. आजही श्रीप्रभूंस माधुकरी भिक्षेचे अन्नच नैवद्य म्हणून समर्पित केले जाते. प्रभूंच्या माधुकरी भिक्षेचे हे कक्ष असून या ठिकाणी श्री बाबासाहेब महाराजांनी घडवून आणलेली श्री दत्तमूर्ती प्रस्थापित केली गेली आहे. पूर्वी ही दत्तमूर्ती श्री सर्वेश्वरच्या मंदिरात होती. औदुंबर वृक्षाची छाया आणी माधुकरी भिक्षेचे औचित्य साधून ई. स. 2015 साली या दत्तमंदिराचे निर्माण करून श्रीदत्त प्रभूंना या ठिकाणी प्रस्थापित केले गेले आहे.',
    'ई. स. 1857 च्या स्वातंत्र्य संग्रमाला श्रीप्रभूंचे पूर्ण सहकार्य होते. निज़ाम व ब्रिटिश पोलिसांचा प्रभूंजवळ असणाऱ्या ब्रह्मचाऱ्यांस उपद्रव होऊ लागला, तेव्हां श्रीप्रभूंनी हे सटके अभिमंत्रित करून प्रत्येक रह्मचाऱ्यांस दिले होते. त्यामुळे त्यांचे रक्षण झाले. युद्ध संपल्यावर प्रभूंनी ते सटके परत मागवून घेतले. अशे 1200 सटके या ठिकाणी सुरक्षित ठेविले आहेत. या सटक्यांना प्रभूंचा दिव्य स्पर्श झाला असल्यामुळे यांचे अनन्यसाधारण महत्व असून प्रतिवर्षी श्री दत्त जयंती उत्सवाचा प्रारंभ या योगदंडांच्या पूजनाने होतो.',
    'श्री माणिकप्रभूंच्या आगमनाच्या आधी अज्ञातकालापासून हा सर्वेश्वर या ठिकाणी प्रस्थापित आहे. श्रीप्रभूंचा मेणा झाडीत अडकल्यामुळे प्रभु या ठिकाणी उतरले आणि या सर्वेश्वराच्या कट्ट्यावर बसले. या दृष्टीने हा सर्वेश्वर माणिकनगरचा आद्य दैवत होय. कै. बाबासाहेब महाराजांनी ई. स. 1922 साली या सर्वेश्वर मंदिराचे जीर्णोद्धार करून या ठिकाणी दत्त मूर्ति प्रस्थापित केली होती. प्रभुमंदिराच्या विस्तारकार्यात या सर्वेश्वर मंदिराचे ई. स. 2015 साली पुनः जीर्णोद्धार करण्यांत आले आहे.',
    'प्रभु संस्थानचें तृतीय आचार्य श्री मार्तंड माणिकप्रभु महाराज व चतुर्थ आचार्य श्री शंकर माणिकप्रभु महाराजांच्या संयुक्त देवालयाला \'मुक्तिमंटप\' असे म्हणतात. या संयुक्त देवालयाचे बांधकाम श्री सिद्धराज माणिकप्रभु महाराजांनी सन् १९७० साली पूर्ण केले. मकरानाहून आणविलेल्या शुभ्र संगमरमरी दगडांनी हें देवालय बांधले गेले असून दोन्हीं समाधींच्या मध्यभागी भव्य असे एक मंटप असून त्या ठिकाणीं चैतन्यलिंग महादेवाची स्थापना करण्यांत आली आहे. या देवालयाच्या शेजारीच श्री सिद्धराज माणिकप्रभु महाराजांच्या समाधी मंदिराचे बांधकाम सध्या चालू आहे.',
    'माणिकनगरांत श्रीदत्तात्रेयांची उपासना त्यांच्या मधुमती शक्ती समवेत होते. श्री मधुमती श्यामलाच श्रीप्रभूंची परम शिष्या देवी व्यंकम्माच्या रूपांत अवतरली असून ती भक्तांचे सर्व मनोरथ पुरविते. देवी व्यंकम्मानी भजन करीत देहत्याग केला, त्यांचे समाज बांधव जेंव्हा अंत्यक्रियेसाठी आले, तेंव्हा देवींच्या पार्थिव देहातून ॐकार ध्वनी निघत असल्याचे आढळले. तेंव्हा श्रीप्रभु स्वत: त्या ठिकाणीं आले, प्रभु येताच व्यंकम्मा समाधीतून जागे झाल्यासाखी उठली व प्रभूंना अंतिम नमस्कार करून पुनः निश्चेष्ट होऊन पडली. प्रभूंनी स्वतःच्या देखरेखीत व्यंकम्माची समाधिविधी पूर्ण करविली. पुढे श्री मार्तंड माणिकप्रभु महाराजांनी देवी व्यंकम्माचे भव्य देवालय बांधवून पूजा, अर्चा, नवरात्र, आदि उत्सव महोत्सव करण्याची परिपाटी प्रारंभ केली. देवी व्यंकम्माचे देवालय हें माणिकनगरचें शक्तिपीठ असून भक्तजनांच्या आत्यंतिक श्रद्धेचे स्थान आहे.',
    'माणिकनगरांत श्रीदत्तात्रेयांची उपासना त्यांच्या मधुमती शक्ती समवेत होते. श्री मधुमती श्यामलाच श्रीप्रभूंची परम शिष्या देवी व्यंकम्माच्या रूपांत अवतरली असून ती भक्तांचे सर्व मनोरथ पुरविते. देवी व्यंकम्मानी भजन करीत देहत्याग केला, त्यांचे समाज बांधव जेंव्हा अंत्यक्रियेसाठी आले, तेंव्हा देवींच्या पार्थिव देहातून ॐकार ध्वनी निघत असल्याचे आढळले. तेंव्हा श्रीप्रभु स्वत: त्या ठिकाणीं आले, प्रभु येताच व्यंकम्मा समाधीतून जागे झाल्यासाखी उठली व प्रभूंना अंतिम नमस्कार करून पुनः निश्चेष्ट होऊन पडली. प्रभूंनी स्वतःच्या देखरेखीत व्यंकम्माची समाधिविधी पूर्ण करविली. पुढे श्री मार्तंड माणिकप्रभु महाराजांनी देवी व्यंकम्माचे भव्य देवालय बांधवून पूजा, अर्चा, नवरात्र, आदि उत्सव महोत्सव करण्याची परिपाटी प्रारंभ केली. देवी व्यंकम्माचे देवालय हें माणिकनगरचें शक्तिपीठ असून भक्तजनांच्या आत्यंतिक श्रद्धेचे स्थान आहे.',
    'श्रीप्रभु मंदिराच्या सिंहद्वाराच्या अगदी समोर गुरुगंगा नदीच्या उत्तरतीरावर श्रीकालाग्निरुद्र मारुतीचे देवालय आहे. हा मारुती माणिकनगरचा क्षेत्ररक्षक असून श्री मार्तंड माणिकप्रभु महाराजांनी सन् 1916 साली या मारुतीची प्रतिष्ठापना केली. हा मारुती अत्यंत उग्र असून सर्व प्रकारच्या उपद्रवांपासून श्रीक्षेत्राचे संरक्षण करतो म्हणून याची स्तुति करीत श्री मार्तंड माणिकप्रभु महाराज म्हणतात - माणिकक्षेत्र अभिमान रक्षणदक्ष। पूर्ण चिन्मार्तंड कामफलदाता।।',
    'श्रीप्रभूंकडे एक साधू आला होता. तो सतत 12 वर्षे एक मारुतीची मूर्ती डोक्यावर घेऊन हिंडत होता. काही केल्या मारुती त्याच्या डोक्यावरून उतरत नसे. या गोष्ठीचा त्याला त्रास होत असे; म्हणून तो प्रभूंकडे आला. प्रभूंकडे येताच मारुतीची मूर्ती हलकी होऊन त्याच्या डोक्यावरचा भार कमी झाल्याचे त्याला जाणवले. प्रभूंनी मारुतीची ती मूर्ती उतरवून घेतली व त्या साधूची सुटका केली. नंतर प्रभूंनी स्वत: त्या मूर्तीची प्राणप्रतिष्ठा केली. प्रभूंचे अग्रज श्री हनुमंत दादामहाराजांनी त्यावर भव्य असे देवालय बांधविले. अशा प्रकारे माणिकनगरच्या ग्रामदेवतेची स्थापना झाली.',
    'प्रभूंच्या सर्वसमावेशक अशा सकलमत संप्रदायांस अनुसरून माणिकनगर येथे प्रभूंच्या लिंगायत मतावलंबी भक्तांसाठी एक मठ असावे; या हेतूने श्री मार्तंड माणिकप्रभु महाराजांनी या वीरशैव मठाची स्थापना केली. येथील पूजा-अर्चा आदि सर्व व्यवस्था श्रीसंस्थान तर्फे मुद्दाम नेमलेल्या जंगामकडून होत असते. श्रावणमासांत येथे विशेष पूजा संपन्न होते.',
    'श्रीप्रभूंना त्यांचे मुसलमान भक्त महबूब सुबहानीचा अवतार मानीत असत व प्रभूंना ते पीरानेपीर दस्तगीर म्हणत असत. आपल्या समाधीनंतर हिंदू व मुसलमान भक्तांमध्ये तंटा होऊ नये म्हणून श्रीप्रभूंनी स्वतः माणिकनगरच्या उत्तरेला असलेल्या टेकडीवर आपल्या डोक्यावरील मंदील ठेऊन त्यावर स्वत:चीच तुरबत उभारली आणि आपल्या सर्व मुसलमान भक्तांना म्हणाले की "आज पासून तुमच्या साठी मी या ठिकाणी बसलो आहे. तुमच्या धर्माप्रमाणें तुम्हाला जी उपासना करायवाची असेल, ती तुम्हीं इथे करावी.” प्रभूंनी स्वत: बांधविलेल्या या जागेस महबूब सुबहानीचा दर्गा किंवा महबूब सुबहानीचा चिल्ला असे म्हणतात. श्रीसंस्थान मार्फत मुसलमानी रिवाजाप्रमाणें या दर्ग्याची सर्व व्यवस्था केली जाते. मोहर्रमच्या महिन्यांत इथे ताजिये बसविले जातात; श्रीमहाराज स्वत: याठिकाणीं येऊन ताजियांची जियारत करतात. महबूब सुबहानीच्या पुण्यतिथी दिवशी म्हणजे ग्यारहवीं शरीफ रोजी इथे विशेष जियारत होऊन फकीरांना अन्नदान केले जाते. हा दर्गा म्हणजे प्रभूंच्या सकलमत सिद्धांताचा जाज्ज्वल्यमान असा प्रमाण आहे. हिंदू व मुसलमान दोन्हीं धर्माचे लोकांचे हें श्रद्धास्थान आहे.',
    '\“आम्हां क्षेत्र माणिकनगर । तीर्थसंगम महिमा थोर ।\n जेथे गुरुगंगा विरजा पवित्र । ऐक्य होऊनि वाहती।।\”\n माणिकनगरच्या दक्षिणेला गुरुगंगा वाहते आणि पूर्वेहून विरजा येऊन आग्नेय दिशेस या दोन्हीं नद्यांचे पवित्र संगम होते. या संगम परिसरांत प्रभूंच्या मातोश्री बयादेवी, प्रभूंचे अग्रज श्री दादा महाराज, प्रभूंचे अनुज श्री तात्या महाराज व श्री सिद्धराज माणिकप्रभूंच्या मातोश्री लक्ष्मीबाई साहेबांच्या समाध्या आहेत. यांच परिसरांत श्री मार्तंड माणिकप्रभूंचे ज्येष्ठ चिरंजीव श्री बाबासाहेब महाराजांचे स्मारक असून त्या समोर अत्यंत मनोरम अशी दगडी पुष्करणी आहे. हे परिसर अत्यंत रमणीय, प्रशांत व एकांत असे असून साधकांना साधना करण्यासाठी ही जागा अत्यंत पवित्र व योग्य अशी आहे.'
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body:
      Column(
        children: [
          Center(
              child: Text(
            'दर्शनीय स्थळें',
            style: TextStyle(
                fontFamily: 'Mukta',
                fontWeight: FontWeight.w800,
                fontSize: 24,
                color: const Color(0xFF630F05)),
          )),

    Expanded(
    child:
    ListView.builder(
      padding: EdgeInsets.fromLTRB(20, 0, 20, 0),
      scrollDirection: Axis.vertical,
        shrinkWrap: true,
    itemCount: titles.length,
    itemBuilder: (BuildContext context, int index) {
      return Column(children: [
      Padding(padding : EdgeInsets.all(10),
      child:
      Center(
            child: Text(
              titles[index],
              style: TextStyle(
                  fontFamily: 'Mukta',
                  fontWeight: FontWeight.w700,
                  fontSize: 20,
                  color: const Color(0xFF630F05)),
            ))),
        Image.asset(images[index]),
        Padding(padding: EdgeInsets.only(top: 10, bottom: 10), child:
        Text(
          descriptions[index],
          style: TextStyle(
            fontSize: 14,
              fontFamily: 'Mukta',
              fontWeight: FontWeight.w400,
              color: const Color(0xFF630F05),
          ),
          textAlign: TextAlign.justify,
        ))
      ],);
    })
    )],
      ),
    );
  }
}
